Ran Plan for project: `demo-kubernetes` dir: `demo-kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # alicloud_cs_managed_kubernetes.my_kubernetes will be created
+ resource "alicloud_cs_managed_kubernetes" "my_kubernetes" {
      + availability_zone           = (known after apply)
      + connections                 = (known after apply)
      + cpu_policy                  = "none"
      + enable_ssh                  = false
      + force_update                = false
      + id                          = (known after apply)
      + image_id                    = "centos_7_7_x64_20G_alibase_20200426.vhd"
      + install_cloud_monitor       = false
      + name                        = "my-kubernetes"
      + name_prefix                 = "Terraform-Creation"
      + nat_gateway_id              = (known after apply)
      + new_nat_gateway             = true
      + node_cidr_mask              = 24
      + password                    = (sensitive value)
      + pod_vswitch_ids             = (known after apply)
      + proxy_mode                  = "ipvs"
      + security_group_id           = (known after apply)
      + service_cidr                = "192.168.128.0/18"
      + slb_id                      = (known after apply)
      + slb_internet                = (known after apply)
      + slb_internet_enabled        = false
      + slb_intranet                = (known after apply)
      + version                     = "1.14.8-aliyun.1"
      + vpc_id                      = (known after apply)
      + worker_disk_category        = "cloud_efficiency"
      + worker_disk_size            = 20
      + worker_instance_charge_type = "PostPaid"
      + worker_instance_types       = [
          + "ecs.c6.xlarge",
        ]
      + worker_nodes                = (known after apply)
      + worker_number               = 2
      + worker_vswitch_ids          = (known after apply)

      + addons {
          + name = "terway-eniip"
        }
      + addons {
          + config = "my-kubernetes-demo"
          + name   = "logtail-ds"
        }
    }

  # alicloud_vswitch.node_vswitch will be created
+ resource "alicloud_vswitch" "node_vswitch" {
      + availability_zone = "ap-southeast-5b"
      + cidr_block        = "172.16.24.0/24"
      + id                = (known after apply)
      + name              = "my-kubernetes-node"
      + vpc_id            = "vpc-k1aabifzjsmg1rx22hnqp"
    }

  # alicloud_vswitch.pod_vswitch will be created
+ resource "alicloud_vswitch" "pod_vswitch" {
      + availability_zone = "ap-southeast-5b"
      + cidr_block        = "172.16.64.0/19"
      + id                = (known after apply)
      + name              = "my-kubernetes-pod"
      + vpc_id            = "vpc-k1aabifzjsmg1rx22hnqp"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "provider_alicloud" but a
value was found in file "../demo-alicloud.tfvars". To use this value, add a
"variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo-kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://149.129.226.51/lock?id=AlibabaCloudIndonesia%252Fterraform-atlantis-chapter5%252Fdemo-kubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo-kubernetes`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
